In [2]:
import pandas as pd
import numpy as np

In [5]:
matriz = np.random.rand(3,3)*100

In [6]:
matriz

array([[81.45174417, 36.76264322, 89.9564335 ],
       [39.15829242, 24.57949982, 24.04960412],
       [56.52961735, 60.83628105, 75.45519616]])

In [7]:
df = pd.DataFrame(matriz)

In [8]:
df

           0          1          2
0  81.451744  36.762643  89.956434
1  39.158292  24.579500  24.049604
2  56.529617  60.836281  75.455196

### A fórmula abaixo transformará o dataframe em um dataframe normalizado com valores entre 0 e 1

In [9]:
normalized_df=(df-df.min())/(df.max()-df.min())

In [10]:
normalized_df

          0         1         2
0  1.000000  0.336024  1.000000
1  0.000000  0.000000  0.000000
2  0.410733  1.000000  0.779974